1. __Count non-missing values by groups__

In [18]:
import pandas as pd
import numpy as np
data = { 'user_id': list(range(1,11,1)),
        'group':[1 if i < 5 else 2 for i in range(10)],
    'qualified_date':['2017-01-17','2018-01-03','2018-01-11',np.nan,np.nan,'2018-01-15','2018-01-7','2018-01-23','2018-01-25','2018-01-11'],
        'loyal_date':['2018-02-03','2018-01-12',np.nan,np.nan,np.nan,'2018-02-14',np.nan,'2018-02-15',np.nan,'2018-03-01']
       }

df= pd.DataFrame(data, columns = ['user_id','group','qualified_date', 'loyal_date'])
df[['qualified_date','loyal_date']]=df[['qualified_date','loyal_date']].apply(lambda x: pd.to_datetime(x))

In [19]:
df.head()

   user_id  group qualified_date loyal_date
0        1      1     2017-01-17 2018-02-03
1        2      1     2018-01-03 2018-01-12
2        3      1     2018-01-11        NaT
3        4      1            NaT        NaT
4        5      1            NaT        NaT

In [20]:
cols = ['qualified_date', 'loyal_date']
df.groupby('group')[cols].agg('count').add_suffix("_count").reset_index()

   group  qualified_date_count  loyal_date_count
0      1                     3                 2
1      2                     5                 3

2 . ** Take difference between two column of pandas dataframe based on condition in python **

In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'code': [101, 102, 103, 105, 107, 110],
                   'apple price': [101, 123, np.nan, 123, 165, 123],
                   'mangoes price': [np.nan, 123, np.nan, 167, np.nan, np.nan],
                   'watermelon price': [np.nan, np.nan, np.nan, np.nan, 177, np.nan],
                   'market price': [122, 124, 123, 154, 176, 123]})
df

   apple price  code  mangoes price  market price  watermelon price
0        101.0   101            NaN           122               NaN
1        123.0   102          123.0           124               NaN
2          NaN   103            NaN           123               NaN
3        123.0   105          167.0           154               NaN
4        165.0   107            NaN           176             177.0
5        123.0   110            NaN           123               NaN

I want to take compare the price of column "market price" and each of the other columns like "apple price","mangoes price", "watermelon price" but prioritize the difference based on the condition : (First priority is watermelon price, second to mangoes and third for apple). Here the first row has just apple price and market price then take their diff, but in second row, we have apple, mangoes price so i have to take only the difference between market price and mangoes price. likewise take the difference based on priority condition. Also skip the rows with nan for all three prices.   
The ** idea is to calculate the differences and overwrite them according to your priority list. **

In [4]:
#Calculate difference to apple price
df['diff'] = df['market price'] - df['apple price']
# Overwrite with difference to mangoes price
df['diff'] = df.apply(lambda x: x['market price'] - x['mangoes price'] if not np.isnan(x['mangoes price']) else x['diff'], axis=1)
# Overwrite with difference to watermelon price
df['diff'] = df.apply(lambda x: x['market price'] - x['watermelon price'] if not np.isnan(x['watermelon price']) else x['diff'], axis=1)
print(df)

   apple price  code  mangoes price  market price  watermelon price  diff
0        101.0   101            NaN           122               NaN  21.0
1        123.0   102          123.0           124               NaN   1.0
2          NaN   103            NaN           123               NaN   NaN
3        123.0   105          167.0           154               NaN -13.0
4        165.0   107            NaN           176             177.0  -1.0
5        123.0   110            NaN           123               NaN   0.0